[
    {
        "keywords": ["how", "upload", "favicon"],
        "response": {
            "title": "Adding a Favicon to v2",
            "footer": "",
            "body": [
                "1. Make sure your favicon is named `favicon.ico` (note the .ico format - for example don't rename a .png to a .ico)\n",
                "2. Upload the favicon to the root directory. (public_html, htdocs or /var/www/html)\n",
                "3. If you still can't see it on your website, try forcing a browser cache refresh by viewing your site and pressing `Ctrl + F5` on windows or `Cmd + Shift + R` on macos.\n",
                "And if you're using Cloudflare, don't forget to purge cache there as well."
            ]
        }
    },
    {
        "keywords": ["The requested URL was not found on this server."],
        "response": {
            "title": "Friendly Urls",
            "footer": "",
            "body": [
                "In order to use friendly urls on your v2 website, your web server has to allow the use of `.htaccess` files and you have to have `mod_rewrite` enabled.\n\n",
                "You can check if `mod_rewrite` is enabled by going to http://yoursite.com/rewrite_test if it says \"Rewrite Enabled\" you're good to go.\n",
                "If not, contact your web host and ask them to enable `mod_rewrite`, or if you're using a vps or a dedicated server, Google information on how to enable `mod_rewrite` on your specific OS.\n\n",
                "As well make sure you have a `.htaccess` file in your root directory, `.htaccess` files are hidden so make sure you have hidden file view enabled on your file manager or ftp client.\n",
                "Your `.htaccess` file should contain these rules: https://raw.githubusercontent.com/NamelessMC/Nameless/v2/.htaccess\n\n",
                "To disable friendly urls, go to `core/config.php` and change \"friendly\" from \"true\" to \"false\"."
            ]
        }
    },
    {
        "keywords": ["Unable to enable incompatible module."],
        "response": {
            "title": "Incompatible module",
            "footer": "",
            "body": [
                "It seems like the module you are trying to enable is **not compatible** with your template! You can do 2 things:\n\n",
                "- Ask the developer of the template you use to add compatibility for it\n",
                "- Use a different template that is compatible"
            ]
        }
    },
    {
        "keywords": ["invalid api method"],
        "response": {
            "title": "Invalid api method",
            "footer": "",
            "body": ["The error `invalid api method` means that the way the enpoint was requested is not supported. This does **NOT** mean that the API is broken, it actually confirms that it IS working. This likely happened because you visited your API URL and got this error. When copy pasting the API URL into a browser, you are not specifying an API method, so the error is correct."]
        }
    },
    {
        "keywords": ["unable to load template 'file"],
        "response": {
             "title": "Unable To Load Template File",
             "footer": "",
             "body": [
                "When you get an error that says \"Unable to load template file:\" `module-name/some-file.tpl` or `some-file.tpl`, it means that either your panel template or your website template (depending on where the error occurs), is missing that module's template file(s).\n\n",
                "If you're using the \"Default\" or \"DefaultRevamp\" templates, the template file(s) for that module should be included in the module's download folder, same goes for the \"Default\" panel template.\n\n",
                "If you're using a premium template, the module template files should've already been included with the template, if they are not, contact the template author.\n",
                "For the free templates, module support is usually pretty shaky, and possibilty for the module support being added is pretty low.\n\n",
                "Most panel templates in the resources page at this time don't support most modules, so you should either wait for the support to be added or use the \"Default\" panel template instead."
            ]
        }
    },
    {
        "keywords": ["change", "prefix", "bot"],
        "response": {
            "title": "Change the command prefix of the Nameless Link Discord bot",
            "footer": "",
            "body": [
                "To change the prefix of the Nameless Link discord bot, run `!prefix <server id> <new prefix>`. Use `reset` to use the default prefix."
            ]
        }
    }
]
